benchmark/results/20250922-182939/release_ramp/load.log

[2025-09-22T18:34:49+03:00] phase=phase1 duration=20s qps=20 concurrency=6

Summary:
  Total:	20.7178 secs
  Slowest:	2.1978 secs
  Fastest:	0.6438 secs
  Average:	1.3965 secs
  Requests/sec:	4.2476
  
  Total data:	264 bytes
  Size/request:	3 bytes

Response time histogram:
  0.644 [1]	|■■■
  0.799 [3]	|■■■■■■■■■
  0.955 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.110 [14]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.265 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.421 [7]	|■■■■■■■■■■■■■■■■■■■■
  1.576 [4]	|■■■■■■■■■■■
  1.732 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.887 [8]	|■■■■■■■■■■■■■■■■■■■■■■■
  2.042 [8]	|■■■■■■■■■■■■■■■■■■■■■■■
  2.198 [9]	|■■■■■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 0.9008 secs
  25% in 1.0023 secs
  50% in 1.2982 secs
  75% in 1.8025 secs
  90% in 2.0477 secs
  95% in 2.1685 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.6438 secs, 2.1978 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	1.3964 secs, 0.6431 secs, 2.1977 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	88 responses



[2025-09-22T18:35:09+03:00] phase=phase2 duration=20s qps=40 concurrency=10

Summary:
  Total:	21.1433 secs
  Slowest:	4.8015 secs
  Fastest:	0.9050 secs
  Average:	2.5999 secs
  Requests/sec:	3.7364
  
  Total data:	237 bytes
  Size/request:	3 bytes

Response time histogram:
  0.905 [1]	|■■■
  1.295 [7]	|■■■■■■■■■■■■■■■■■■■■
  1.684 [8]	|■■■■■■■■■■■■■■■■■■■■■■■
  2.074 [14]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.464 [10]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.853 [7]	|■■■■■■■■■■■■■■■■■■■■
  3.243 [7]	|■■■■■■■■■■■■■■■■■■■■
  3.633 [11]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.022 [6]	|■■■■■■■■■■■■■■■■■
  4.412 [5]	|■■■■■■■■■■■■■■
  4.802 [3]	|■■■■■■■■■


Latency distribution:
  10% in 1.3937 secs
  25% in 1.8015 secs
  50% in 2.5025 secs
  75% in 3.4764 secs
  90% in 4.1237 secs
  95% in 4.4244 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.9050 secs, 4.8015 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	2.5996 secs, 0.9032 secs, 4.8014 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0007 secs

Status code distribution:
  [200]	79 responses



[2025-09-22T18:35:30+03:00] phase=phase3 duration=20s qps=80 concurrency=18

Summary:
  Total:	22.0901 secs
  Slowest:	8.5718 secs
  Fastest:	0.7507 secs
  Average:	4.4368 secs
  Requests/sec:	3.8931
  
  Total data:	258 bytes
  Size/request:	3 bytes

Response time histogram:
  0.751 [1]	|■■
  1.533 [6]	|■■■■■■■■■■■■■■
  2.315 [6]	|■■■■■■■■■■■■■■
  3.097 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  3.879 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  4.661 [17]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.443 [6]	|■■■■■■■■■■■■■■
  6.225 [6]	|■■■■■■■■■■■■■■
  7.008 [4]	|■■■■■■■■■
  7.790 [7]	|■■■■■■■■■■■■■■■■
  8.572 [8]	|■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 2.0751 secs
  25% in 3.0039 secs
  50% in 4.1736 secs
  75% in 5.8992 secs
  90% in 7.8993 secs
  95% in 8.3026 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 0.7507 secs, 8.5718 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	4.4364 secs, 0.7494 secs, 8.5706 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	86 responses



[2025-09-22T18:35:53+03:00] phase=phase4 duration=20s qps=120 concurrency=24

Summary:
  Total:	22.9702 secs
  Slowest:	8.5804 secs
  Fastest:	1.2276 secs
  Average:	5.6987 secs
  Requests/sec:	4.0052
  
  Total data:	276 bytes
  Size/request:	3 bytes

Response time histogram:
  1.228 [1]	|■■
  1.963 [1]	|■■
  2.698 [3]	|■■■■■
  3.433 [9]	|■■■■■■■■■■■■■■■■
  4.169 [12]	|■■■■■■■■■■■■■■■■■■■■■■
  4.904 [13]	|■■■■■■■■■■■■■■■■■■■■■■■■
  5.639 [4]	|■■■■■■■
  6.375 [5]	|■■■■■■■■■
  7.110 [10]	|■■■■■■■■■■■■■■■■■■
  7.845 [22]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  8.580 [12]	|■■■■■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 2.9784 secs
  25% in 4.0251 secs
  50% in 6.0969 secs
  75% in 7.3734 secs
  90% in 8.1186 secs
  95% in 8.3761 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0002 secs, 1.2276 secs, 8.5804 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	5.6983 secs, 1.2273 secs, 8.5802 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200]	92 responses



[2025-09-22T18:36:16+03:00] phase=plateau duration=20s qps=120 concurrency=24

Summary:
  Total:	23.6714 secs
  Slowest:	11.3993 secs
  Fastest:	1.5665 secs
  Average:	6.0055 secs
  Requests/sec:	3.7598
  
  Total data:	267 bytes
  Size/request:	3 bytes

Response time histogram:
  1.567 [1]	|■■
  2.550 [1]	|■■
  3.533 [9]	|■■■■■■■■■■■■■■■■■■
  4.516 [18]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  5.500 [12]	|■■■■■■■■■■■■■■■■■■■■■■■■
  6.483 [20]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  7.466 [9]	|■■■■■■■■■■■■■■■■■■
  8.449 [2]	|■■■■
  9.433 [6]	|■■■■■■■■■■■■
  10.416 [2]	|■■■■
  11.399 [9]	|■■■■■■■■■■■■■■■■■■


Latency distribution:
  10% in 3.5047 secs
  25% in 4.3011 secs
  50% in 5.6416 secs
  75% in 7.0656 secs
  90% in 10.7003 secs
  95% in 11.1013 secs
  0% in 0.0000 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0003 secs, 1.5665 secs, 11.3993 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	6.0051 secs, 1.5652 secs, 11.3991 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0001 secs

Status code distribution:
  [200]	89 responses